app/Models/ModelAdmin.php

    public function AllData()
    {
        return $this->orderBy('Id_penerbit', "asc")->findAll();
---
SELECT *
FROM `tbl_penerbit`
ORDER BY `Id_penerbit` ASC

    public function ubahdata($data)
    {
        $this->db->table('tbl_buku')->where('Id_buku', $data['Id_buku'])->update($data);
---
UPDATE `tbl_buku` SET `Id_buku` = 'N1002', `Kategori` = 'Novel', `Nama_buku` = 'Aku ingin Cerita', `Harga` = '48000', `Stok` = '6', `Penerbit` = 'Danendra'
WHERE `Id_buku` = 'N1002'

    public function ubahdatap($data)
    {
        $this->db->table('tbl_penerbit')->where('Nama', $data['Nama'])->update($data);
---
UPDATE `tbl_penerbit` SET `Nama` = 'Andi Offset', `Id_penerbit` = 'SP02', `Alamat` = 'Jl. Surya laya IX No 3', `Kota` = 'Bandung surabaya', `Telepon` = '087839030688'
WHERE `Nama` = 'Andi Offset'