app/Models/ModelPengadaan.php

    public function AllData($stok = 10)
    {
        return $this->db->table('tbl_buku')->where('Stok <', '10')->orderBy('Stok', "asc")->get()->getResultArray();
---
SELECT *
FROM `tbl_buku`
WHERE `Stok` < '10'
ORDER BY `Stok` ASC